import { SankeyDatum } from "../sankey/types";

export const chartData: SankeyDatum = {
    "nodes": [
        {
            "name": "Сдача помещений в аренду",
        },
        {
            "name": "Выручка",
        },
        {
            "name": "Оказание услуг",
        },
        {
            "name": "Реализация продукции",
        },
        {
            "name": "Займы",
        },
        {
            "name": "Поступления",
        },
        {
            "name": "Расходы",
            "color": "#93211f",
        },
        {
            "name": "Коммерческие",
            "color": "#931f59",
        },
        {
            "name": "Производственные",
            "color": "#6c6ce0",
        },
        {
            "name": "Управленческие",
            "color": "#bf4088",
        },
        {
            "name": "Реклама",
            "color": "#8dd22d",
        },
        {
            "name": "Командировочные",
            "color": "#cad22d",
        },
        {
            "name": "Заработная плата менеджеров",
            "color": "#c58d87",
        },
        {
            "name": "Заработная плата рабочих",
            "color": "#93501f",
        },
        {
            "name": "Уплата % по кредитам",
            "color": "#ac539c",
        },
        {
            "name": "Приобретение сырья, материалов",
            "color": "#78503a",
        },
        {
            "name": "Заработная плата администрации",
            "color": "#d2799a",
        },
        {
            "name": "Обучение персонала",
            "color": "#57bf40",
        },
        {
            "name": "Аренда офисных помещений",
            "color": "#3a7862",
        },
        {
            "name": "Прибыль",
            "color": "#49783a",
        }
    ],
    "links": [
        {
            "source": "Сдача помещений в аренду",
            "target": "Выручка",
            "value": 1000
        },
        {
            "source": "Оказание услуг",
            "target": "Выручка",
            "value": 300
        },
        {
            "source": "Реализация продукции",
            "target": "Выручка",
            "value": 1500
        },
        {
            "source": "Займы",
            "target": "Поступления",
            "value": 350
        },
        {
            "source": "Выручка",
            "target": "Поступления",
            "value": 2030
        },
        {
            "source": "Поступления",
            "target": "Расходы",
            "value": 1280
        },
        {
            "source": "Расходы",
            "target": "Коммерческие",
            "value": 280
        },
        {
            "source": "Расходы",
            "target": "Производственные",
            "value": 930
        },
        {
            "source": "Расходы",
            "target": "Управленческие",
            "value": 270
        },
        {
            "source": "Коммерческие",
            "target": "Реклама",
            "value": 170
        },
        {
            "source": "Коммерческие",
            "target": "Командировочные",
            "value": 150
        },
        {
            "source": "Коммерческие",
            "target": "Заработная плата менеджеров",
            "value": 160
        },
        {
            "source": "Производственные",
            "target": "Заработная плата рабочих",
            "value": 440
        },
        {
            "source": "Производственные",
            "target": "Уплата % по кредитам",
            "value": 140
        },
        {
            "source": "Производственные",
            "target": "Приобретение сырья, материалов",
            "value": 550
        },
        {
            "source": "Управленческие",
            "target": "Заработная плата администрации",
            "value": 130
        },
        {
            "source": "Управленческие",
            "target": "Обучение персонала",
            "value": 120
        },
        {
            "source": "Управленческие",
            "target": "Аренда офисных помещений",
            "value": 220
        },
        {
            "source": "Поступления",
            "target": "Прибыль",
            "value": 1100
        }
    ]
}
